### US - Baby Names

We are going to use a subset of US Baby Names from Kaggle.
In the file it will be names from 2004 until 2014

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('US_Baby_Names_right.csv')

In [3]:
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [4]:
df.drop(columns = ['Unnamed: 0'] , inplace = True)

In [5]:
df.drop(columns = ['Id'] , inplace = True)

In [6]:
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [7]:
df['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [ ]:
df[df['Gender'] == 'F'].mean()

In [8]:
Names = df.groupby('Name')

In [9]:
df['Name'].nunique()

17632

In [10]:
df['Name'].value_counts().sort_values(ascending = False).head(1)

Riley    1112
Name: Name, dtype: int64

In [12]:
df['Name'].value_counts().sort_values(ascending = True).head(1)

Farzana    1
Name: Name, dtype: int64

In [22]:
df.Count.sum()

35421492

In [24]:
df.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

In [26]:
df['Count'].describe()

count    1.016395e+06
mean     3.485012e+01
std      9.739735e+01
min      5.000000e+00
25%      7.000000e+00
50%      1.100000e+01
75%      2.600000e+01
max      4.167000e+03
Name: Count, dtype: float64

In [32]:
df[df.Count == df.Count.max()]

          Name  Year Gender State  Count
107416  Daniel  2004      M    CA   4167

In [34]:
df[df.Count == df.Count.median()]

                Name  Year Gender State  Count
71           Makayla  2004      F    AK     11
72             Maria  2004      F    AK     11
73              Mary  2004      F    AK     11
74          Michelle  2004      F    AK     11
259        Alexandra  2005      F    AK     11
...              ...   ...    ...   ...    ...
1016276  Christopher  2014      M    WY     11
1016277       Corbin  2014      M    WY     11
1016278        Gavin  2014      M    WY     11
1016279      Greyson  2014      M    WY     11
1016280       Isaiah  2014      M    WY     11

[36199 rows x 5 columns]